; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c8-s4-p25-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 c5 c6 c7 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 l3-0 l3-1 l3-2 l3-3 l4-0 l4-1 l4-2 l4-3 l5-0 l5-1 l5-2 l5-3 l6-0 l6-1 l6-2 l6-3 l7-0 l7-1 l7-2 l7-3 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (CITY c7)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (TRUCK t7)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l6-2)
    (in-city  l6-2 c6)
    (LOCATION l6-3)
    (in-city  l6-3 c6)
    (LOCATION l7-0)
    (in-city  l7-0 c7)
    (LOCATION l7-1)
    (in-city  l7-1 c7)
    (LOCATION l7-2)
    (in-city  l7-2 c7)
    (LOCATION l7-3)
    (in-city  l7-3 c7)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (AIRPORT l7-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (OBJ p23)
    (OBJ p24)
    (at t0 l0-3)
    (at t1 l1-1)
    (at t2 l2-2)
    (at t3 l3-0)
    (at t4 l4-0)
    (at t5 l5-0)
    (at t6 l6-0)
    (at t7 l7-1)
    (at p0 l1-1)
    (at p1 l2-0)
    (at p2 l4-2)
    (at p3 l2-0)
    (at p4 l4-2)
    (at p5 l4-2)
    (at p6 l6-1)
    (at p7 l7-1)
    (at p8 l3-0)
    (at p9 l7-1)
    (at p10 l4-3)
    (at p11 l2-3)
    (at p12 l4-0)
    (at p13 l7-1)
    (at p14 l4-3)
    (at p15 l2-1)
    (at p16 l5-1)
    (at p17 l5-1)
    (at p18 l3-3)
    (at p19 l5-3)
    (at p20 l1-1)
    (at p21 l5-3)
    (at p22 l6-1)
    (at p23 l4-1)
    (at p24 l1-3)
    (at a0 l6-0)
    (at a1 l5-0)
    (at a2 l3-0)
)
(:goal
    (and
        (at p0 l3-1)
        (at p1 l2-1)
        (at p2 l4-3)
        (at p3 l1-0)
        (at p4 l0-1)
        (at p5 l3-2)
        (at p6 l2-0)
        (at p7 l7-3)
        (at p8 l1-2)
        (at p9 l6-2)
        (at p10 l1-3)
        (at p11 l7-3)
        (at p12 l6-2)
        (at p13 l4-2)
        (at p14 l7-1)
        (at p15 l6-2)
        (at p16 l2-0)
        (at p17 l7-2)
        (at p18 l7-0)
        (at p19 l2-3)
        (at p20 l5-2)
        (at p21 l2-3)
        (at p22 l6-1)
        (at p23 l6-0)
        (at p24 l4-0)
    )
)
)

; plan
1. (load-truck p9 t7 l7-1)
   deleted: (at p9 l7-1)
   added: (in p9 t7)
   goals met: 1 of 25
2. (load-truck p7 t7 l7-1)
   deleted: (at p7 l7-1)
   added: (in p7 t7)
   goals met: 1 of 25
3. (load-truck p13 t7 l7-1)
   deleted: (at p13 l7-1)
   added: (in p13 t7)
   goals met: 1 of 25
4. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 1 of 25
5. (load-truck p1 t2 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 t2)
   goals met: 1 of 25
6. (load-truck p20 t1 l1-1)
   deleted: (at p20 l1-1)
   added: (in p20 t1)
   goals met: 1 of 25
7. (load-truck p0 t1 l1-1)
   deleted: (at p0 l1-1)
   added: (in p0 t1)
   goals met: 1 of 25
8. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 25
9. (unload-truck p20 t1 l1-0)
   deleted: (in p20 t1)
   added: (at p20 l1-0)
   goals met: 1 of 25
10. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 1 of 25
11. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 1 of 25
12. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 1 of 25
13. (load-airplane p20 a2 l1-0)
   deleted: (at p20 l1-0)
   added: (in p20 a2)
   goals met: 1 of 25
14. (load-airplane p0 a2 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a2)
   goals met: 1 of 25
15. (drive-truck t7 l7-1 l7-0 c7)
   deleted: (at t7 l7-1)
   added: (at t7 l7-0)
   goals met: 1 of 25
16. (unload-truck p9 t7 l7-0)
   deleted: (in p9 t7)
   added: (at p9 l7-0)
   goals met: 1 of 25
17. (unload-truck p13 t7 l7-0)
   deleted: (in p13 t7)
   added: (at p13 l7-0)
   goals met: 1 of 25
18. (drive-truck t7 l7-0 l7-3 c7)
   deleted: (at t7 l7-0)
   added: (at t7 l7-3)
   goals met: 1 of 25
19. (unload-truck p7 t7 l7-3)
   deleted: (in p7 t7)
   added: (at p7 l7-3)
   goals met: 2 of 25
20. (drive-truck t6 l6-0 l6-1 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-1)
   goals met: 2 of 25
21. (load-truck p6 t6 l6-1)
   deleted: (at p6 l6-1)
   added: (in p6 t6)
   goals met: 2 of 25
22. (drive-truck t6 l6-1 l6-0 c6)
   deleted: (at t6 l6-1)
   added: (at t6 l6-0)
   goals met: 2 of 25
23. (unload-truck p6 t6 l6-0)
   deleted: (in p6 t6)
   added: (at p6 l6-0)
   goals met: 2 of 25
24. (load-airplane p6 a0 l6-0)
   deleted: (at p6 l6-0)
   added: (in p6 a0)
   goals met: 2 of 25
25. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 2 of 25
26. (load-truck p17 t5 l5-1)
   deleted: (at p17 l5-1)
   added: (in p17 t5)
   goals met: 2 of 25
27. (load-truck p16 t5 l5-1)
   deleted: (at p16 l5-1)
   added: (in p16 t5)
   goals met: 2 of 25
28. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 2 of 25
29. (unload-truck p17 t5 l5-0)
   deleted: (in p17 t5)
   added: (at p17 l5-0)
   goals met: 2 of 25
30. (unload-truck p16 t5 l5-0)
   deleted: (in p16 t5)
   added: (at p16 l5-0)
   goals met: 2 of 25
31. (load-airplane p17 a1 l5-0)
   deleted: (at p17 l5-0)
   added: (in p17 a1)
   goals met: 2 of 25
32. (load-airplane p16 a1 l5-0)
   deleted: (at p16 l5-0)
   added: (in p16 a1)
   goals met: 2 of 25
33. (drive-truck t5 l5-0 l5-3 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-3)
   goals met: 2 of 25
34. (load-truck p21 t5 l5-3)
   deleted: (at p21 l5-3)
   added: (in p21 t5)
   goals met: 2 of 25
35. (load-truck p19 t5 l5-3)
   deleted: (at p19 l5-3)
   added: (in p19 t5)
   goals met: 2 of 25
36. (drive-truck t5 l5-3 l5-0 c5)
   deleted: (at t5 l5-3)
   added: (at t5 l5-0)
   goals met: 2 of 25
37. (unload-truck p21 t5 l5-0)
   deleted: (in p21 t5)
   added: (at p21 l5-0)
   goals met: 2 of 25
38. (unload-truck p19 t5 l5-0)
   deleted: (in p19 t5)
   added: (at p19 l5-0)
   goals met: 2 of 25
39. (load-airplane p21 a1 l5-0)
   deleted: (at p21 l5-0)
   added: (in p21 a1)
   goals met: 2 of 25
40. (load-airplane p19 a1 l5-0)
   deleted: (at p19 l5-0)
   added: (in p19 a1)
   goals met: 2 of 25
41. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 2 of 25
42. (load-truck p23 t4 l4-1)
   deleted: (at p23 l4-1)
   added: (in p23 t4)
   goals met: 2 of 25
43. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 2 of 25
44. (unload-truck p23 t4 l4-0)
   deleted: (in p23 t4)
   added: (at p23 l4-0)
   goals met: 2 of 25
45. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 2 of 25
46. (load-truck p5 t4 l4-2)
   deleted: (at p5 l4-2)
   added: (in p5 t4)
   goals met: 2 of 25
47. (load-truck p4 t4 l4-2)
   deleted: (at p4 l4-2)
   added: (in p4 t4)
   goals met: 2 of 25
48. (load-truck p2 t4 l4-2)
   deleted: (at p2 l4-2)
   added: (in p2 t4)
   goals met: 2 of 25
49. (drive-truck t4 l4-2 l4-3 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-3)
   goals met: 2 of 25
50. (unload-truck p2 t4 l4-3)
   deleted: (in p2 t4)
   added: (at p2 l4-3)
   goals met: 3 of 25
51. (load-truck p14 t4 l4-3)
   deleted: (at p14 l4-3)
   added: (in p14 t4)
   goals met: 3 of 25
52. (load-truck p10 t4 l4-3)
   deleted: (at p10 l4-3)
   added: (in p10 t4)
   goals met: 3 of 25
53. (drive-truck t4 l4-3 l4-2 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-2)
   goals met: 3 of 25
54. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 3 of 25
55. (load-truck p18 t3 l3-3)
   deleted: (at p18 l3-3)
   added: (in p18 t3)
   goals met: 3 of 25
56. (drive-truck t3 l3-3 l3-1 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-1)
   goals met: 3 of 25
57. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 3 of 25
58. (load-truck p15 t2 l2-1)
   deleted: (at p15 l2-1)
   added: (in p15 t2)
   goals met: 3 of 25
59. (unload-truck p1 t2 l2-1)
   deleted: (in p1 t2)
   added: (at p1 l2-1)
   goals met: 4 of 25
60. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 4 of 25
61. (unload-truck p15 t2 l2-0)
   deleted: (in p15 t2)
   added: (at p15 l2-0)
   goals met: 4 of 25
62. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 4 of 25
63. (load-truck p11 t2 l2-3)
   deleted: (at p11 l2-3)
   added: (in p11 t2)
   goals met: 4 of 25
64. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 4 of 25
65. (unload-truck p11 t2 l2-0)
   deleted: (in p11 t2)
   added: (at p11 l2-0)
   goals met: 4 of 25
66. (drive-truck t1 l1-0 l1-3 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-3)
   goals met: 4 of 25
67. (load-truck p24 t1 l1-3)
   deleted: (at p24 l1-3)
   added: (in p24 t1)
   goals met: 4 of 25
68. (drive-truck t1 l1-3 l1-0 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-0)
   goals met: 4 of 25
69. (unload-truck p24 t1 l1-0)
   deleted: (in p24 t1)
   added: (at p24 l1-0)
   goals met: 4 of 25
70. (load-airplane p24 a2 l1-0)
   deleted: (at p24 l1-0)
   added: (in p24 a2)
   goals met: 4 of 25
71. (fly-airplane a2 l1-0 l3-0)
   deleted: (at a2 l1-0)
   added: (at a2 l3-0)
   goals met: 4 of 25
72. (load-airplane p8 a2 l3-0)
   deleted: (at p8 l3-0)
   added: (in p8 a2)
   goals met: 4 of 25
73. (unload-airplane p0 a2 l3-0)
   deleted: (in p0 a2)
   added: (at p0 l3-0)
   goals met: 4 of 25
74. (drive-truck t4 l4-2 l4-0 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-0)
   goals met: 4 of 25
75. (unload-truck p5 t4 l4-0)
   deleted: (in p5 t4)
   added: (at p5 l4-0)
   goals met: 4 of 25
76. (unload-truck p4 t4 l4-0)
   deleted: (in p4 t4)
   added: (at p4 l4-0)
   goals met: 4 of 25
77. (unload-truck p14 t4 l4-0)
   deleted: (in p14 t4)
   added: (at p14 l4-0)
   goals met: 4 of 25
78. (unload-truck p10 t4 l4-0)
   deleted: (in p10 t4)
   added: (at p10 l4-0)
   goals met: 4 of 25
79. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 4 of 25
80. (unload-truck p18 t3 l3-0)
   deleted: (in p18 t3)
   added: (at p18 l3-0)
   goals met: 4 of 25
81. (load-truck p0 t3 l3-0)
   deleted: (at p0 l3-0)
   added: (in p0 t3)
   goals met: 4 of 25
82. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 4 of 25
83. (unload-airplane p8 a2 l1-0)
   deleted: (in p8 a2)
   added: (at p8 l1-0)
   goals met: 4 of 25
84. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 4 of 25
85. (fly-airplane a2 l1-0 l5-0)
   deleted: (at a2 l1-0)
   added: (at a2 l5-0)
   goals met: 4 of 25
86. (unload-airplane p20 a2 l5-0)
   deleted: (in p20 a2)
   added: (at p20 l5-0)
   goals met: 4 of 25
87. (load-truck p20 t5 l5-0)
   deleted: (at p20 l5-0)
   added: (in p20 t5)
   goals met: 4 of 25
88. (drive-truck t5 l5-0 l5-2 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-2)
   goals met: 4 of 25
89. (unload-truck p20 t5 l5-2)
   deleted: (in p20 t5)
   added: (at p20 l5-2)
   goals met: 5 of 25
90. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 5 of 25
91. (unload-truck p0 t3 l3-1)
   deleted: (in p0 t3)
   added: (at p0 l3-1)
   goals met: 6 of 25
92. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 6 of 25
93. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 6 of 25
94. (unload-truck p8 t1 l1-2)
   deleted: (in p8 t1)
   added: (at p8 l1-2)
   goals met: 7 of 25
95. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 7 of 25
96. (fly-airplane a0 l6-0 l2-0)
   deleted: (at a0 l6-0)
   added: (at a0 l2-0)
   goals met: 7 of 25
97. (unload-airplane p6 a0 l2-0)
   deleted: (in p6 a0)
   added: (at p6 l2-0)
   goals met: 8 of 25
98. (load-airplane p3 a0 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a0)
   goals met: 8 of 25
99. (load-airplane p15 a0 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 a0)
   goals met: 8 of 25
100. (fly-airplane a1 l5-0 l2-0)
   deleted: (at a1 l5-0)
   added: (at a1 l2-0)
   goals met: 8 of 25
101. (unload-airplane p21 a1 l2-0)
   deleted: (in p21 a1)
   added: (at p21 l2-0)
   goals met: 8 of 25
102. (load-truck p21 t2 l2-0)
   deleted: (at p21 l2-0)
   added: (in p21 t2)
   goals met: 8 of 25
103. (unload-airplane p19 a1 l2-0)
   deleted: (in p19 a1)
   added: (at p19 l2-0)
   goals met: 8 of 25
104. (load-truck p19 t2 l2-0)
   deleted: (at p19 l2-0)
   added: (in p19 t2)
   goals met: 8 of 25
105. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 8 of 25
106. (unload-truck p21 t2 l2-3)
   deleted: (in p21 t2)
   added: (at p21 l2-3)
   goals met: 9 of 25
107. (unload-truck p19 t2 l2-3)
   deleted: (in p19 t2)
   added: (at p19 l2-3)
   goals met: 10 of 25
108. (unload-airplane p16 a1 l2-0)
   deleted: (in p16 a1)
   added: (at p16 l2-0)
   goals met: 11 of 25
109. (load-airplane p11 a1 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 a1)
   goals met: 11 of 25
110. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 11 of 25
111. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 11 of 25
112. (unload-airplane p3 a0 l1-0)
   deleted: (in p3 a0)
   added: (at p3 l1-0)
   goals met: 12 of 25
113. (fly-airplane a0 l1-0 l3-0)
   deleted: (at a0 l1-0)
   added: (at a0 l3-0)
   goals met: 12 of 25
114. (load-airplane p18 a0 l3-0)
   deleted: (at p18 l3-0)
   added: (in p18 a0)
   goals met: 12 of 25
115. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 12 of 25
116. (load-airplane p5 a0 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 a0)
   goals met: 12 of 25
117. (load-airplane p4 a0 l4-0)
   deleted: (at p4 l4-0)
   added: (in p4 a0)
   goals met: 12 of 25
118. (load-airplane p23 a0 l4-0)
   deleted: (at p23 l4-0)
   added: (in p23 a0)
   goals met: 12 of 25
119. (load-airplane p14 a0 l4-0)
   deleted: (at p14 l4-0)
   added: (in p14 a0)
   goals met: 12 of 25
120. (load-airplane p12 a0 l4-0)
   deleted: (at p12 l4-0)
   added: (in p12 a0)
   goals met: 12 of 25
121. (fly-airplane a2 l5-0 l4-0)
   deleted: (at a2 l5-0)
   added: (at a2 l4-0)
   goals met: 12 of 25
122. (unload-airplane p24 a2 l4-0)
   deleted: (in p24 a2)
   added: (at p24 l4-0)
   goals met: 13 of 25
123. (load-airplane p10 a2 l4-0)
   deleted: (at p10 l4-0)
   added: (in p10 a2)
   goals met: 13 of 25
124. (fly-airplane a2 l4-0 l1-0)
   deleted: (at a2 l4-0)
   added: (at a2 l1-0)
   goals met: 13 of 25
125. (unload-airplane p10 a2 l1-0)
   deleted: (in p10 a2)
   added: (at p10 l1-0)
   goals met: 13 of 25
126. (load-truck p10 t1 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 t1)
   goals met: 13 of 25
127. (drive-truck t1 l1-0 l1-3 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-3)
   goals met: 13 of 25
128. (unload-truck p10 t1 l1-3)
   deleted: (in p10 t1)
   added: (at p10 l1-3)
   goals met: 14 of 25
129. (fly-airplane a0 l4-0 l0-0)
   deleted: (at a0 l4-0)
   added: (at a0 l0-0)
   goals met: 14 of 25
130. (unload-airplane p4 a0 l0-0)
   deleted: (in p4 a0)
   added: (at p4 l0-0)
   goals met: 14 of 25
131. (load-truck p4 t0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 14 of 25
132. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 14 of 25
133. (unload-truck p4 t0 l0-1)
   deleted: (in p4 t0)
   added: (at p4 l0-1)
   goals met: 15 of 25
134. (fly-airplane a0 l0-0 l3-0)
   deleted: (at a0 l0-0)
   added: (at a0 l3-0)
   goals met: 15 of 25
135. (unload-airplane p5 a0 l3-0)
   deleted: (in p5 a0)
   added: (at p5 l3-0)
   goals met: 15 of 25
136. (load-truck p5 t3 l3-0)
   deleted: (at p5 l3-0)
   added: (in p5 t3)
   goals met: 15 of 25
137. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 15 of 25
138. (unload-truck p5 t3 l3-2)
   deleted: (in p5 t3)
   added: (at p5 l3-2)
   goals met: 16 of 25
139. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 16 of 25
140. (fly-airplane a0 l4-0 l6-0)
   deleted: (at a0 l4-0)
   added: (at a0 l6-0)
   goals met: 16 of 25
141. (unload-airplane p23 a0 l6-0)
   deleted: (in p23 a0)
   added: (at p23 l6-0)
   goals met: 17 of 25
142. (unload-airplane p15 a0 l6-0)
   deleted: (in p15 a0)
   added: (at p15 l6-0)
   goals met: 17 of 25
143. (load-truck p15 t6 l6-0)
   deleted: (at p15 l6-0)
   added: (in p15 t6)
   goals met: 17 of 25
144. (unload-airplane p12 a0 l6-0)
   deleted: (in p12 a0)
   added: (at p12 l6-0)
   goals met: 17 of 25
145. (load-truck p12 t6 l6-0)
   deleted: (at p12 l6-0)
   added: (in p12 t6)
   goals met: 17 of 25
146. (drive-truck t6 l6-0 l6-2 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-2)
   goals met: 17 of 25
147. (unload-truck p15 t6 l6-2)
   deleted: (in p15 t6)
   added: (at p15 l6-2)
   goals met: 18 of 25
148. (unload-truck p12 t6 l6-2)
   deleted: (in p12 t6)
   added: (at p12 l6-2)
   goals met: 19 of 25
149. (fly-airplane a1 l2-0 l7-0)
   deleted: (at a1 l2-0)
   added: (at a1 l7-0)
   goals met: 19 of 25
150. (load-airplane p9 a1 l7-0)
   deleted: (at p9 l7-0)
   added: (in p9 a1)
   goals met: 19 of 25
151. (unload-airplane p17 a1 l7-0)
   deleted: (in p17 a1)
   added: (at p17 l7-0)
   goals met: 19 of 25
152. (load-airplane p13 a1 l7-0)
   deleted: (at p13 l7-0)
   added: (in p13 a1)
   goals met: 19 of 25
153. (unload-airplane p11 a1 l7-0)
   deleted: (in p11 a1)
   added: (at p11 l7-0)
   goals met: 19 of 25
154. (fly-airplane a1 l7-0 l4-0)
   deleted: (at a1 l7-0)
   added: (at a1 l4-0)
   goals met: 19 of 25
155. (unload-airplane p13 a1 l4-0)
   deleted: (in p13 a1)
   added: (at p13 l4-0)
   goals met: 19 of 25
156. (load-truck p13 t4 l4-0)
   deleted: (at p13 l4-0)
   added: (in p13 t4)
   goals met: 19 of 25
157. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 19 of 25
158. (unload-truck p13 t4 l4-2)
   deleted: (in p13 t4)
   added: (at p13 l4-2)
   goals met: 20 of 25
159. (fly-airplane a1 l4-0 l6-0)
   deleted: (at a1 l4-0)
   added: (at a1 l6-0)
   goals met: 20 of 25
160. (unload-airplane p9 a1 l6-0)
   deleted: (in p9 a1)
   added: (at p9 l6-0)
   goals met: 20 of 25
161. (fly-airplane a0 l6-0 l7-0)
   deleted: (at a0 l6-0)
   added: (at a0 l7-0)
   goals met: 20 of 25
162. (unload-airplane p18 a0 l7-0)
   deleted: (in p18 a0)
   added: (at p18 l7-0)
   goals met: 21 of 25
163. (unload-airplane p14 a0 l7-0)
   deleted: (in p14 a0)
   added: (at p14 l7-0)
   goals met: 21 of 25
164. (drive-truck t7 l7-3 l7-0 c7)
   deleted: (at t7 l7-3)
   added: (at t7 l7-0)
   goals met: 21 of 25
165. (load-truck p17 t7 l7-0)
   deleted: (at p17 l7-0)
   added: (in p17 t7)
   goals met: 21 of 25
166. (load-truck p14 t7 l7-0)
   deleted: (at p14 l7-0)
   added: (in p14 t7)
   goals met: 21 of 25
167. (load-truck p11 t7 l7-0)
   deleted: (at p11 l7-0)
   added: (in p11 t7)
   goals met: 21 of 25
168. (drive-truck t7 l7-0 l7-1 c7)
   deleted: (at t7 l7-0)
   added: (at t7 l7-1)
   goals met: 21 of 25
169. (unload-truck p14 t7 l7-1)
   deleted: (in p14 t7)
   added: (at p14 l7-1)
   goals met: 22 of 25
170. (drive-truck t7 l7-1 l7-2 c7)
   deleted: (at t7 l7-1)
   added: (at t7 l7-2)
   goals met: 22 of 25
171. (unload-truck p17 t7 l7-2)
   deleted: (in p17 t7)
   added: (at p17 l7-2)
   goals met: 23 of 25
172. (drive-truck t7 l7-2 l7-3 c7)
   deleted: (at t7 l7-2)
   added: (at t7 l7-3)
   goals met: 23 of 25
173. (unload-truck p11 t7 l7-3)
   deleted: (in p11 t7)
   added: (at p11 l7-3)
   goals met: 24 of 25
174. (drive-truck t6 l6-2 l6-0 c6)
   deleted: (at t6 l6-2)
   added: (at t6 l6-0)
   goals met: 24 of 25
175. (load-truck p9 t6 l6-0)
   deleted: (at p9 l6-0)
   added: (in p9 t6)
   goals met: 24 of 25
176. (drive-truck t6 l6-0 l6-2 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-2)
   goals met: 24 of 25
177. (unload-truck p9 t6 l6-2)
   deleted: (in p9 t6)
   added: (at p9 l6-2)
   goals met: 25 of 25
